cf_billing/Documents/энргУстановитьДополнительнуюСоциальнуюНорму.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьДополнительнуюСоциальнуюНорму</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргЗначенияДополнительныхСоциальныхНормативов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНормативы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеИспользованияТУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНорматива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьДополнительнуюСоциальнуюНорму/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;                  	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","Услуга","ДопСоциальнаяНормаПотребления"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
		
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьДополнительнуюСоциальнуюНорму";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодам());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстДляПроведенияПоСтабильнымПериодам()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	энргУстановитьДополнительнуюСоциальнуюНормуДополнительныеНормативы.Услуга КАК Услуга,
	|	энргУстановитьДополнительнуюСоциальнуюНормуДополнительныеНормативы.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВЫБОР
	|		КОГДА ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|			ТОГДА энргУстановитьДополнительнуюСоциальнуюНормуДополнительныеНормативы.ЗначениеНорматива
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДопСоциальнаяНормаПотребления
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДополнительнуюСоциальнуюНорму.ДополнительныеНормативы КАК энргУстановитьДополнительнуюСоциальнуюНормуДополнительныеНормативы
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргУстановитьДополнительнуюСоциальнуюНормуДополнительныеНормативы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДополнительнуюСоциальнуюНорму КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка";
	
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецЕсли
